Revit 2027 API
FabricationServiceSettings.HasValidFluidSetting Method
 Is the service associated with a fluid type and temperature?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValidFluidSetting(
	FabricationService service
)
Public Function HasValidFluidSetting (
	service As FabricationService
) As Boolean
public:
bool HasValidFluidSetting(
	FabricationService^ service
)
member HasValidFluidSetting :
        service : FabricationService -> bool
Parameters
service FabricationService
 The service to lookup.
Return Value
Boolean
 True if the service is associated with a fluid type and temperature, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceSettings Class
Autodesk.Revit.DB Namespace